JoseTrinidadLM/GRID_FORMING_STM32F446RE_PA/GRID_FORMING/Src/main.c
	/*In case there is a high presence of noise, signals will be filtered*/

	cosine = v_g;		//This is just an example to show its functionality

	sine = NINETYDegreePhaseShift(cos_buffer, cosine, &Buffer_Counter_Cos, &Buffer_Ready_Flag_Cos);

	i_L90 = NINETYDegreePhaseShift(i_L_buffer, i_L, &Buffer_Counter_iL, &Buffer_Ready_Flag_iL);
	
	i_Q = QTransform(cosine, sine, i_L, i_L90);

	if(OPERATION_MODE == 0)
	{
		OpenLoop(v_g, &u_control_pos, &u_control_neg);
	} else
	{
		CascadeControl(cosine, sine, v_cd, i_Q, i_inv, &e1_z_0, &e1_z_1, &e2_z_0, &e2_z_1, &y1_z_0, &y1_z_1, &y2_z_0, &y2_z_1, &u_control_pos, &u_control_neg);
	}

	TIM_PWM_DutyCycle(&TIM_1, u_control_pos);
	TIM_PWM_DutyCycle(&TIM_4, u_control_neg);

}

/*This interruption can be triggered by GPIOB 14-15*/
void EXTI15_10_IRQHandler(void)
{
	static uint8_t PWM_ENABLE = 0;
	GPIO_IRQHandling(14);
	/*Both pins are read*/
	PWM_ENABLE = GPIO_ReadFromInputPin(GPIOB, 14);
	OPERATION_MODE = GPIO_ReadFromInputPin(GPIOB, 15);				//This lecture autmatically changes Operation Mode as: Open Loop when Operation Mode = 0, Closed Loop when 1


	/*When Operation Mode is zero it resets PI controllers from CascadeControl(), to assure safe and smooth transition to Closed Loop Mode Operation*/
	if( OPERATION_MODE == 0 )
	{
		ResetPIControllers(&e1_z_0, &e1_z_1, &e2_z_0, &e2_z_1, &y1_z_0, &y1_z_1, &y2_z_0, &y2_z_1);
		status &= ~(1 << 0); //Set Loop Status Flag to Open 
	} else
	{
		status |= (1 << 0); //Set Loop Status Flag to Closed
	}

	/*To disable PWM output, when PWM_ENABLE is 0 TIM5 (which controls PWM GPIO C7-A9) is stopped and both pins are reset. When PWM_ENABLE is 1 it starts TIM5 again*/
	if( PWM_ENABLE == 0 )
	{
		TIM_PWM_Disable(&TIM_1);
		TIM_PWM_Disable(&TIM_4);
		GPIO_WriteToOutputPin(GPIOA, GPIO_PIN_NO_9, RESET);
		GPIO_WriteToOutputPin(GPIOB, GPIO_PIN_NO_6, RESET);

		status &= ~(1 << 1); //Set PWM Status Flag to Disabled

	} else if( PWM_ENABLE == 1 )
	{
		TIM_PWM_Enable(&TIM_1);
		TIM_PWM_Enable(&TIM_4);

		status |= (1 << 1); //Set PWM Status Flag to Enabled

	}
}

void ShiftSensorsValue(void)
{
	for(uint64_t x = BUFFER_SIZE-1; x>0; x--)
	{
		//TO-DO: shift processed values
		;
	}
}

void USART_DecodeRX(USART_Handle_t *pUSARTHandle)
{
	/*
	uint8_t message[2];
	static uint8_t valid = DISABLE;
	pUSARTHandle->pRxBuffer -= pUSARTHandle->RxLen;

	for(int x = 0; x < pUSARTHandle->RxLen; x++)
	{
		message[x] = *pUSARTHandle->pRxBuffer;
		pUSARTHandle->pRxBuffer++;
	}


	if(receive_data[0] == '$')
	{
		valid = ENABLE;
		while(USART_ReceiveDataWithIT(&USART2Handle,(uint8_t *)receive_data, 2) != USART_READY);
	}else
	{
		while(USART_ReceiveDataWithIT(&USART2Handle,(uint8_t *)receive_data, 1) != USART_READY);
	}
	*/

	if(receive_data[0] == '$')
	{
		if(receive_data[1] == 'X')
		{
			executeCommand(receive_data[2]);
			//valid = DISABLE;
		}
	}
}

void USART_HeartBeatTX(void)
{
	//while(!(USART2Handle.pUSARTx->SR & USART_SR_TC));
	USART_ClearFlag(USART2Handle.pUSARTx, USART_TC_FLAG);
	heartbeat[3] = status;
	heartbeat[4] = frequency;

	DMA_SetAddresses(&DMA1Handle, (void*)heartbeat, (void*)&USART2Handle.pUSARTx->DR);
	DMA_ConfigureBuffer(&DMA1Handle, 5);
	DMA_StartTransfer(&DMA1Handle);
}

void USART_TelemetryTX(void)
{
	//while(!(USART2Handle.pUSARTx->SR & USART_SR_TC));
	USART_ClearFlag(USART2Handle.pUSARTx, USART_TC_FLAG);
	telemetry[3] = getValue_Variable('V') >> 24;
	telemetry[4] = (getValue_Variable('V') >> 16) & 0xFF;
	telemetry[5] = (getValue_Variable('V') >> 8) & 0xFF;
	telemetry[6] = (getValue_Variable('V')) & 0xFF;

	telemetry[10] = getValue_Variable('C') >> 24;
	telemetry[11] = (getValue_Variable('C') >> 16) & 0xFF;
	telemetry[12] = (getValue_Variable('C') >> 8) & 0xFF;
	telemetry[13] = (getValue_Variable('C')) & 0xFF;

	telemetry[17] = getValue_Variable('F') >> 24;
	telemetry[18] = (getValue_Variable('F') >> 16) & 0xFF;
	telemetry[19] = (getValue_Variable('F') >> 8) & 0xFF;
	telemetry[20] = (getValue_Variable('F')) & 0xFF;

	telemetry[24] = getValue_Variable('D') >> 24;
	telemetry[25] = (getValue_Variable('D') >> 16) & 0xFF;
	telemetry[26] = (getValue_Variable('D') >> 8) & 0xFF;
	telemetry[27] = (getValue_Variable('D')) & 0xFF;

	telemetry[31] = getValue_Variable('Z') >> 24;
	telemetry[32] = (getValue_Variable('Z') >> 16) & 0xFF;
	telemetry[33] = (getValue_Variable('Z') >> 8) & 0xFF;
	telemetry[34] = (getValue_Variable('Z')) & 0xFF;

	DMA_SetAddresses(&DMA1Handle, (void*)telemetry, (void*)&USART2Handle.pUSARTx->DR);
	DMA_ConfigureBuffer(&DMA1Handle, 35);
	DMA_StartTransfer(&DMA1Handle);
}

void TIM3_IRQHandler(void)
{
	USART_HeartBeatTX();
	TIM_IRQHandling(&TIM3Handle);
}

void USART2_IRQHandler(void)
{
	USART_IRQHandling(&USART2Handle);
}

void USART_ApplicationEventCallback(USART_Handle_t *pUSARTHandle,uint8_t ApEv)
{
	if(ApEv == USART_EVENT_RX_CMPLT)
	{
	   USART_DecodeRX(pUSARTHandle);
	}else if (ApEv == USART_EVENT_TX_CMPLT)
	{
	   ;
	}
}

void DMA_ApplicationEventCallback(DMA_Handle_t *pDMAHandle, uint8_t ApEv)
{
	if(ApEv == DMA_EVENT_TCIF_CMPLT)
	{
		DMA_StopTransfer(&DMA1Handle);
		USART_TelemetryTX();
	}
}

void DMA1_Stream6_IRQHandler(void)
{
	DMA_IRQHandling(&DMA1Handle);
}
